1.Сетевой коммутатор это –
Специализированное сетевое устройство, предназначенное для соединения нескольких узлов
компьютерной сети в пределах одного или нескольких сегментов сети
2.Выберите вид записи маски подсети, который соответствует заданной маске 255.255.488.0
a)/21
d)11111111.11111111.11111000.00000000
варианты a) и d)
3.Одноранговая сеть это –
Не имеющая централизованного управления ресурсами(узлами) сеть. Каждый компьютер,
подключенный…
4. Выберите вид записи маски подсети, который соответствует заданной маске /16
255.255.0.0
5.Коэффициент загрузки сегмента сети необходимо рассчитывать
Для определения надёжности и стабильности функционирования сети при заданной нагрузке
6.Таблица маршрутизации это –электронная таблица…
Которая описывает соответствие между адресами назначения и интерфейсами, через которые
следует отправить пакет данных до следующего маршрутизатора. Является простейшей формой
правил маршрутизации
7.Укажите, какому диапазону предложенных подсетей принадлежит заданный IP-адрес
192.168.1.9
ко всем предложенным
8.Управление работой концентратора производится с использованием протокола
IP
9.Для полного дуплекса длина оптоволоконного кабеля составляет
До 2-10 км
10.По протоколу 1000Base-T файл размером 1 Гб можно в лучшем случае передать
от 13 до 16 секунд
11. Выберите маршрут, который необходимо прописать …
Искомая подсеть: 192.168.2.0 маска подсети 255.255.255.0
Настройки сетевого интерфейса (сетевой карты):
IP-адрес 192.168.0.10 маска сети 255.255.255.0
IP-адрес маршрутизатора№1: 192.168.0.1
IP-адрес маршрутизатора№2: 192.168.1.1
d) не хватает данных указать правильный маршрут
12.Маршрутизатор это –
Специализированное сетевое устройство, имеющее как минимум один сетевой интерфейс и
пересылающее пакеты данных между различными сегментами сети, связывающее разнородные
сети различных архитектур, принимающее решения о пересылке на основании информации о
топологии сети и определенных правил, заданных администратором сети.
13.Размер заголовка кадра Ethernet составляет
112 бит
14.Сеть построена с использованием коммутируемого концентратора на протоколе 100baseT4 и
состоит из 5 компьютеров. Длина кабеля от каждого компьютера до концентратора 10м.
Необходимо рассчитать значение PDV
От 276 до 300
15. Выберите маршрут, который необходимо прописать …
Искомая подсеть: 192.168.2.0 маска подсети 255.255.254.0
Настройки сетевого интерфейса (сетевой карты):
IP-адрес 192.168.1.10 маска сети 255.255.254.0
IP-адрес маршрутизатора: 192.168.0.1
IP-адрес маршрутизатора: 192.168.2.1
route add 192.168.2.0 netmask255.255.254.0 gw 192.168.0.1
16. Выберите маршрут, который необходимо прописать …
Искомая подсеть: 192.168.0.0 маска подсети 255.255.255.248
Настройки сетевого интерфейса (сетевой карты):
IP-адрес 192.168.0.10 маска сети 255.255.255.248
IP-адрес маршрутизатора: 192.168.0.1
IP-адрес маршрутизатора: 192.168.0.9
Route add 192.168.0.0 netmask 255.255.255.248 gw 192.168.0.9
17. Таблица маршрутизации содержит
все вышеперечисленное
18.Предельное значение PDV для протокола 100baseT4 будет равно
512
19.Кабель сети 10BASE-T для передачи данных между концентратором и узлом сети называется
Патчкордом
20. К функциям концентраторов Ethernet следует отнести.
пересылку пакетов из порта в порты, отключение портов в аварийных ситуациях
21.Что такое коммутаторы третьего уровня(L3)
Коммутаторы, выполняющие маршрутизацию
22.Укажите какие из предложенных сетей входят в частный диапазон IP-адресов:
а) 192.168.0.0/255.255.255.0
c)FC00:112A:86BA:AA11:0:0:0:0/64
e) варианты a) и c)
23. Выберите маршрут, который необходимо прописать для получения доступа к искомой
подсети, если сетевое оборудование имеет единственный интерфейс (например, компьютер с
одной сетевой картой) с заданными сетевыми настройками, а также существует один или
несколько связанных друг с другом маршрутизаторов с известными сетевыми адресами:
Искомая подсеть: 192.168.0.8; маска подсети 255.255.255.248
Настройки сетевого интерфейса (сетевой карты):
IP-адрес: 192.168.0.10; маска сети: 255.255.255.248
IP-адрес маршрутизатора №1: 192.168.0.1
IP-адрес маршрутизатора №2: 192.168.0.9
d) нет необходимости что-либо прописывать
24. Маршрутизация —
процесс определения маршрута следования информации в сетях связи.
25.IP-адрес это –
Уникальный сетевой адрес узла в комп. сети, построенный по протоколу IP
26. Локальная вычислительная сеть (ЛВС/LAN) Это –
компьютерная сеть, покрывающая обычно относительно небольшую территорию или небольшую
группу зданий
28. Из перечисленных ниже записей выделите сходства Fast Ethernet и Ethernet:
одинаковый формат кадра
29. Выберите маршрут, который необходимо прописать …
Искомая подсеть: 192.168.1.0 маска подсети 255.255.255.0
Настройки сетевого интерфейса (сетевой карты):
IP-адрес 192.168.0.10 маска сети 255.255.255.248
IP-адрес маршрутизатора: 192.168.0.1
Не хватает данных
30. MAC-адрес это —
уникальный идентификатор, присваиваемый каждой единице активного оборудования
компьютерных сетей
31. Метрика –
это числовой показатель, задающий предпочтительность маршрута: чем меньше число, тем
более предпочтителен маршрут
32. Маской подсети называется битовая маска,
определяющая, какая часть IP адреса узла сети относится к адресу сети, а какая к адресу самого
узла в этой сети
33. Укажите, какому диапазону предложенных подсетей принадлежит заданный IP-адрес
2001::10.0.4.195
2001::10.0.4.0/120
34. Сетевое устройство, предназначенное для объединения нескольких устройств Ethernet в
общий сегмент сети, носит название:
Концентратор
35. Управление работой концентратора производится с использованием протокола :
 IP
36. Какой сегмент известен как "толстый Ethernet"?
10BASE-5
37. Практическое максимальное число узлов, которые могут быть соединены с 10BASE-5
сегментом, составляет:
100
38. Основной характеристикой маршрутизатора является
количество обрабатываемых пакетов за секунду
39. Коэффициент загрузки сегмента сети для протокола 100BaseTX рассчитывается
для кадра размеров 72 байта
40. Компьютерная сеть это —
система связи компьютеров или вычислительного оборудования (серверы, маршрутизаторы и
другое оборудование)
41. Какие устройства обычно используются для подключения локальной сети к глобальной
сети?
Маршрутизаторы
42. Сетевой концентратор это —
Специальное сетевое устройство для объединения компьютеров в сеть с применением кабельной
инструкторы типа витая пара
43. Для чего служит алгоритм Spanning Tree
для удаления замкнутых путей в сети
44. Для чего служит сигнал-пробка?
для усиления коллизий
45. На каком уровне протоколов работает концентратор? –
Физический
46. PING – это утилита, которая
все варианты в целом наиболее полно продолжают заданное предложение
47. PING – программа командной строки…
позволяющая определить время между ICMP-запросами…
48. Коммутируемый концентратор работает на уровне протоколов –
канальный
49. Размер заголовка TCP пакета составляет
160 бит
50. Импеданс кабеля сегмента 10BASE-5 составляет:
50 Ом
51. ARP это –
протокол в компьютерных сетях, предназначенный для определения MAC адреса по известному
IP-адресу.
52.Выберите вид записи маски подсети, который соответствует заданной маске
1111 1111,1111 1111,1111 1111,1100 0000
255.255.255.192
53. Кабель сети 10BASE-T для передачи данных между двумя шинами называется
кроссовером
54. Когда необходимо использовать перекрестный кабель в сети 10BASE-T?
при непосредственном соединении между собой двух компьютеров
55. Таблица коммутации содержит
Список MAC адресов
56. Коэффициент загрузки сети измеряется
безразмерная величина
57. Сеть построена с использованием коммутируемого концентратора на протоколе 100baseT4 и
состоит из 7 компьютеров. Длина кабеля от каждого компьютера до концентратора 100м.
Необходимо рассчитать значение PDV
От 350 до 399
58. Какая сеть не гарантирует величину времени доступа?
Ethernet
59.Пакеты какой сети не включают в себя MAC-адреса?
все пакеты включают в себя MAC-адрес
60. FCE – это
ложная несущая
62. В какой сети сетевая нагрузка не разделяется: с коммутатором
или с концентратором?
с концентратором.
67. Выберите вид записи маски подсети, который соответствует заданной маске
255.255.248.0
a)/21
d)11111111.11111111.11111000.00000000
варианты a) и d)
68. Выберите вид записи маски подсети, который соответствует заданной маске
/16
a)255.255.0.0
69. В чем основные отличия маршрутизаторов от коммутаторов?
маршрутизаторы обеспечивают неограниченный размер маршрутизируемой сети,
маршрутизаторы медленнее и дороже коммутаторов
70. В какой сети поддерживается полный дуплекс: с коммутатором
или с концентратором?
с коммутатором
71. В стеке протоколов OSI, 10BASE-T находится
на физическом уровне
72. В чем основное преимущество сети FDDI перед остальными стандартными сетями?
максимальный размер сети
73. В чем основное отличие метода управления FDDI от метода управления Token-Ring?
возможность одновременного присутствия в сети нескольких пакетов
74. Формат пакета какой сети не входит поле контрольной суммы?
поле контрольной суммы входит во все пакеты
75. В чем отличие концентратора класса I от концентратора класса II?
он преобразует принятые сигналы перед передачей в цифровую форму
76. В каком из случаев совокупность данных может быть определена как поток. Если
идет речь о задаче коммутации?
Совокупность данных, которые направляются от определенного узла к другому определенному 
узлу.
Совокупность данных, генерируемых определенным положением и направляемых по
определенному адресу.
Совокупность данных, поступающих на определенный входной интерфейс коммутатора.
77. В чем состоит основное преимущество сети Arcnet перед
Ethernet?
Использование 93-атомного коаксиального кабеля
78. В какой сети задержка больше: с коммутатором или с концентратором?
с коммутатором
79. В какой сети сетевая нагрузка не разделяется: с коммутатором или с
концентратором?
с концентратором
80. Для чего служит алгоритм Spanning Tree
для удаления замкнутых путей в сети
81. Для полного дуплекса длина оптоволоконного кабеля составляет:
до 2—10 км
82. Допустимая длина сети в методе CSMA/CD:
равна максимальному допустимому PDV
83. Длительность передачи одного бита в CSMA/CD называется:
BT
84. Длина сегмента кабеля 100BASE-T ограничена
- 100 метрами
85. Для сети Ethernet 10 Мбит/с PDV не должна превышать
- 512 BT
86. Для сокращения PDV в сети Ethernet следует
- уменьшать длину кабелей
87. Для перехода сети Ethernet на FDDI требуются
- мосты
88. Для чего минимальный размер кадра в Gigabit Ethernet
увеличен до 512 байт?
- для увеличения допустимой области коллизий
89. Для скорости выше 10 000 Мбит/с единственной доступной средой передачи является
Оптоволокно
90. Для чего служит сигнал-пробка?
для усиления коллизий
91. Длина сегмента сети 100BASE-FX может достигать
400 метров+
92. Для сети Fast Ethernet двойная задержка концентратора класса II для T4 составляет:
67+
93. Для сети Fast Ethernet двойная задержка концентратора класса II для TX/FX составляет:
92
94. Для чего используется Jam-последовательность?
для усиления коллизии
95. Для синхронизации приема в пакете Ethernet используется
Преамбула
96. Для какого протокола из представленных jumbo frame cамый большой
IEEE 802.3
97. ECE это:
множественные коллизии
98. Замкнутый путь в сети носит название
- петля
99. Из каких аппаратурных узлов состоит вычислитель циклической
контрольной суммы:
из триггеров и элементов «Исключающее ИЛИ»
100. Используется ли буферизация в сетях с коммутацией каналов? :
нет, никогда
101. IPG это:
межпакетная щель
102. Импеданс кабеля сегмента 10BASE-5 составляет:
50 Ом
103. Из перечисленных ниже записей выделите сходства Fast Ethernet и Ethernet:
одинаковый формат кадра
104. Из приведенных ниже записей выделите функции моста Ethernet:
объединение сегментов Ethernet
105. Из приведенных ниже записей выделите особенности сквозных
коммутаторов:
имеют буфер только на заголовок пакета
106. Из приведенных ниже записей выделите топологии, применяемые в
Ethernet
пассивная звезда, шина, облако
107. Из приведенных ниже записей выделите коды, применяемые в Ethernet
4В/5В
108. Из приведенных ниже записей выделите составляющие части пакета Ethernet:
контрольная сумма, время трассировки
109. IP-адрес этоУникальный сетевой адрес узла в компьютерной сети, построенный по
протоколу IP
110. К какому типу адреса можно отнести MAC-адрес на устройстве Ethernet:
числовой, плоский
111. Кабель сети 10BASE-T для передачи данных между концентратором и
узлом сети называется:
патчкордом
112. Какая сеть не гарантирует величину времени доступа?
Ethernet
113. Какой сегмент известен как "толстый Ethernet"?
10BASE-5
114. К функциям концентраторов Ethernet следует отнести.
пересылку пакетов из порта в порты, отключение портов в аварийных ситуациях
115. Коммутируемый концентратор работает на уровне протоколов –
канальный
116. Коэффициент загрузки сегмента сети для протокола 100BaseTX
рассчитывается:
для кадра размером 72 байта
117. Какие устройства обычно используются для подключения локальной сети к
глобальной сети?
Маршрутизаторы
118. Какой кадр можно уверенно считать не искаженным коллизией?
кадр, для которого выполняются все три перечисленные условия
119. Какова длительность сигнала-пробки?
32 битовых интервала
120. Количество единиц в коде образующего полинома CRC должно быть
Минимальным (четным)
121. Какую информацию содержит поле управления в пакете
Ethernet/Fast Ethernet?
информацию о составе и формате поля данных
122. Какая ошибка не регистрируются и не исправляются репитерными
концентраторами?
- ошибка в контрольной сумме пакета
123. Какой трансивер используется в 10Base-5?
- внешний
124. Концентраторы всегда работают в режиме
- полудуплекса
125. Какой параметр сетевого адаптера важен менее других?
поддержка удаленной загрузки
126. Какой параметр сетевого сервера важен менее других?
качественные средства интерфейса пользователя
127. Какое сетевое устройство обеспечивает минимальную задержку пересылки
пакетов?
концентратор класса II
128.Какое сетевое устройство не может поддерживать обмен между сегментами с
разными скоростями?
коммутатор Cut-Through
129.Какие промежуточные сетевые устройства не допускают управления по протоколу
SNMP?
концентраторы класса II
130.Какое сетевое устройство анализирует содержимое поля данных пакета?
Маршрутизатор
131.К основным характеристикам сетевых концентраторов следует отнести
скорость передачи данных, количество портов, тип сетевого носителя
132.К чему приводит увеличение скорости сети со 100 Мбит/с до
1000 Мбит/с?
- к снижению нагрузки на сеть в 10 раз
133.К методам кодирования Gigabit Ethernet следует отнести
- 8B/10B, - PAM5
134.Какой сегмент сети 10Gigabit Ethernet описывается стандартом IEEE
802.3an?
10GBASE-T
135.К перспективным возможностям управления сетью на основе коммутатора следует отнести
контроль трафика, определение предельных скоростей портов, протокол SNMP
136.Какая сеть дороже: с коммутатором или с концентратором?
с концентратором
137.К направлениям развития коммутаторов следует отнести
увеличение скорости коммутирования, поддержку разных стандартных сегментов
138.Какой сегмент сети Gigabit Ethernet наименее перспективен?
1000BASE-CX
139.К промежуточным сетевым устройствам Ethernet следует отнести
репитер, концентратор
140.Какие последствия влечет за собой увеличение скорости сети?
увеличение пропускной способности сети
141.Какова должна быть разрядность образующего полинома для 16-разрядной контрольной
суммы?
17 разрядов
142.Как действует абонент при обнаружении коллизий при методе CSMA/CD?
прекращает передачу пакета и повторяет попытку передать
143.Как высчитывается задержка повторной передачи в методе CSMA/CD?
задержка выбирается случайно и кратна 512 BT
144.Какова продолжительность IPG?
96 бит
145.Кадр считается искаженным коллизией, если
имеет длину, не равную целому числу байт
имеет длину, меньшую минимально допустимого размера
имеет неправильную контрольную сумму (Все правильные)
146.Какой сегмент Ethernet/Fast Ethernet обеспечивает наибольшее расстояние
между компьютерами сети?
10BASE-FL
147.Когда необходимо использовать перекрестный кабель в сети
10BASE-T?
при непосредственном соединении между собой двух компьютеров
148.Какие сегменты Fast Ethernet используют одинаковую систему кодировки?
100BASE-TX и 100BASE-FX
149.Какой тип сегмента не распознается механизмом автосогласования
(Auto-Negotiation)?
10BASE-FL
150.Какой тип кабеля используется в сегменте 10BASE-T?
витая пара
151.Как распределяются функции витых пар в сегменте
100BASE-T4?
одна витая пара передает в одну сторону, одна— в другую сторону, две витые пары —
двунаправленные
152.Какой стандартный сегмент Ethernet обеспечивает максимальную длину
на электрическом кабеле?
10BASE5
153.Каковы основные достоинства сети Fast Ethernet?
совместимость с Ethernet и высокая скорость передачи
154.Какой метод доступа используется в беспроводных сетях
WLAN?
CSMA/CA
155.Каково главное преимущество сети Wi-Fi перед сетью
Ethernet/Fast Ethernet?
мобильность и простота подключения
156.К составляющим частям информационного пакета Wi-Fi следует отнести:
контрольную сумму, управление очередностью
157.Каково главное преимущество сети Wi-Fi перед сетью Ethernet/Fast Ethernet?
мобильность и простота подключения
158.Какова длина пакета сети Ethernet/Fast Ethernet без преамбулы?
от 64 байт до 1518 байт
159.Каково основное преимущество сети Token-Ring по сравнению с
Ethernet/Fast Ethernet?
гарантированное время доступа к сети
160.Какой основной недостаток сети FDDI по сравнению с другими стандартными
сетями?
большая стоимость
161.Каково назначение резервного кольца в сети Token-Ring?
оно включается вместо рабочего кольца при повреждении кабеля
162.Каково назначение концентратора в сети 100VG-AnyLAN?
Управление доступом к сети
163.Какую функцию выполняет концентратор сети Token-Ring?
объединение точек подключения абонентов
164.Какую функцию не выполняет активный монитор сети Token-Ring?
предоставляет абонентам право передачи
165.К элементам маркера FDDI относятся:
Преамбула, Статус пакета
166.К методам контроля ошибок передающим абонентом следует отнести
сравнение переданного пакета и пакета, возвращенного принимающим абонентом; побитовую
проверку в процессе передачи пакета
167.Какая сеть обеспечивает совместимость с сетью Ethernet на уровне формата пакета?
100VG-AnyLAN
168.К составляющим частям топологии сети Ethernet следует отнести
Концентратор, репитер
169.Как высчитывается задержка повторной передачи в методе
CSMA/CD?
задержка выбирается случайно и кратна 512 BT
170.Какие величины необходимо рассчитывать при оценке работоспособности Ethernet?
двойное время распространения по сети и сокращение межпакетного интервала
171.Каким образом можно разбить сеть Ethernet на несколько частей?
с помощью мостов, с помощью коммутаторов
172.Каков метод доступа в сети Wi-Fi?
Случайный
173.Какой метод доступа используется в беспроводных сетях WLAN?
CSMA/CA
174.Компьютерная сеть это —
система связи компьютеров или вычислительного оборудования (серверы, маршрутизаторы и
другое оборудование)
175.Каково максимально допустимое количество повторов попыток передачи?
16+
176.Какой концентратор можно применять для объединения сегментов 100BASE-TX и 100BASET4?
концентратор класса I
177.Какой метод нельзя применять для преодоления ограничений на размер сети (зоны
конфликта) Ethernet?
применение дополнительных концентраторов
178.К методам контроля ошибок передающим абонентом следует отнести
- сравнение переданного пакета и пакета, возвращенного принимающим абонентом,-
побитовую проверку в процессе передачи пакета
179.Какова максимально допустимая величина сокращения межпакетного
интервала в Ethernet?
49 битовых интервалов
180.Как в сети Fast Ethernet учитывается сокращение межпакетного
интервала (IPG)?
для Fast Ethernet расчет этой величины в принципе не нужен
181.Каковы основные преимущества полнодуплексного режима?
максимальная длина сегмента и высокая пропускная способность
182.Какая сеть не описывается стандартом IEEE 802?
FDDI
183.Какую функцию не выполняет активный монитор сети
Token-Ring?
предоставляет абонентам право передачи
184.К составляющим частям PDV следует отнести
Задержки в сетевых адаптерах, задержки в концентраторах
185.Как в сети Ethernet учитываются задержки сетевых адаптеров и
концентраторов?
эти задержки входят в задержки сегментов в качестве констант
186.К методам решения проблем Ethernet следует отнести
уменьшение длины кабелей для сокращения PDV
187.Как MAC-адреса удаляются из внутренней таблицы коммутатора?
удаляются системным администратором
188.К типам коммутаторов следует отнести
сквозные коммутаторы, гибридные коммутаторы
189.К стандартным сегментам 10Gigabit Ethernet следует отнести
10GBASE-ER, 10GBASE-LR, 10GBASE-T
190.К функциям сетевого администратора следует отнести
модернизацию программного обеспечения, резервное копирование данных,
обучение новых пользователей
191. К критическим ситуациям сквозных коммутаторов следует отнести
потерю пакетов при одновременном приходе на коммутатор нескольких пакетов приход на
коммутатор карликового пакета
приход на коммутатор испорченного пакета
192. Коэффициент загрузки сегмента сети необходимо рассчитать
Для определения надёжности и стабильности функционирования сети при 
заданной нагрузке
193. Локальная вычислительная сеть (ЛВС/LAN) Это –
компьютерная сеть, покрывающая обычно относительно небольшую территорию
или небольшую группу зданий
194. Маской подсети называется битовая маска,
определяющая, какая часть IP адреса узла сети относится к адресу сети, а какая к адресу
самого узла в этой сети
195. Метрика –
это числовой показатель, задающий предпочтительность маршрута: чем меньше
число, тем более предпочтителен маршрут
196. Маршрутизация —
Процесс определения маршрута следования информации в сетях связи.
197. Максимальная скорость передачи в сети 10BASE-2 составляет
- 10 Мбит/с
198. Маршрутизаторы работают
- с логическими адресами
199. Максимальная скорость передачи данных в сети Fast Ethernet в
полудуплексе составляет
100 Мбит/с
200. Максимальная длина сегмента сети 10BASE-2 составляет
185 м
201. Максимальная скорость передачи в сегменте 10BASE-5 составляет
10 Мбит/с
202. Максимальное количество абонентов в сети
Ethernet составляет?
1024
203. Максимальное количество абонентов сети Arcnet составляет:
255
204. Максимальная длина сегмента сети 10BASE-5 составляет
500 м
205. Максимальная задержка повтора передачи в методе CSMA/CD составляет
1024 ST
206. Максимальное число абонентов сети Token-Ring составляет
96
207. Метод доступа в сети FDDI является
маркерным
208. Минимальный интервал между пакетами в CSMA/CD носит название
IPG
209. MAC-адрес это —
уникальный идентификатор, присваиваемый каждой единице активного оборудования
компьютерных сетей
210. На концах кабеля сегмента 10BASE-5 устанавливаются терминаторы с
сопротивлением
- 50 Ом
211. На физическом конце сети 10BASE-2 Т-коннектор, присоединённый к рабочей
станции требует установки терминатора
на 50 Ом
212. На каком уровне сетевой модели OSI работает концентратор?
на физическом
213. На интегральную скорость передачи информации влияют
- время обмена информацией с компьютером,- задержка в промежуточных
устройствах
214. На концы кабеля сегмента 10BASE-2 подключаются
BNC-коннекторы
215. Основной характеристикой маршрутизатора является c) количество
обрабатываемых пакетов за секунду
216. Образующий полином в коде CRC должен
делится по модулю 2 без остатка только на единицу и на самого себя
217. Одноранговая сеть
Не имеющая централизованного
218. Практическое максимальное число узлов, которые могут быть соединены с
10BASE-5 сегментом, составляет:
100
219. Пакеты какой сети не включают в себя MAC-адреса?
все пакеты включают в себя MAC-адрес
220. Простые коммутаторы не поддерживают
- объединение разнородных сетей,- алгоритм удаления петель
221. Применение каких устройств позволяет снять любые ограничения на
размер сети?
Маршрутизаторов
222. Пересылка пакетов в сети с концентратором осуществляется
по одному пакету
223. При проектировании сети следует учитывать
интенсивность информационных потоков в сети, характер передаваемой
информации, требуемый размер сети
224. PDV – это
двойное время прохождения сигнала между абонентами сети+ двойная задержка
распространения сигнала
225. Передаваемый в сети Ethernet кадр, размером меньше 512 байт, называется
карликовым
226. Предельная двойная задержка в сети Ethernet составляет
51,2 мкс
227. При делении с остатком степень многочлена-остатка
меньше степени многочлена-делителя
228. Предельное значение PDV для протокола 100baseT4 будет равно
512
229. Размер сети с коммутатором определяется
широковещательной областью
230. Размер сети с концентратором определяется
областью коллизии
231. Разъемы какого типа не используются в сегменте 10BASE-FL?
разъем RJ-45
232. Размер заголовка TCP пакета составляет
160 бит
233. Размер заголовка кадра Ethernet составляет
112 бит
234. Сетевое устройство, предназначенное для объединения нескольких устройств Ethernet в
общий сегмент сети, носит название.
Концентратор
235. Сетевой концентратор
Сетевое устройство, предназначенное для объединения нескольких устройств Ethernet в общий
сегмент сети, с помощью кабельной инфраструктуры витая пара
236. Сетевые адаптеры могут быть
Внешними, встроенными
237. Скорость передачи данных в сегменте 10BASE-T составляет
10 Мбит/с
238. Сколько байт занимает управление очередностью в пакете Wi-Fi?
2
239. CRC – это
циклический избыточный код
240. Сколько концентраторов может присутствовать в сети
(области коллизий) Fast Ethernet?
2 концентратора класса II
241. Топологией сети Token-Ring является:
Кольцо
242. Топологией сети 100VG-AnyLAN является:
Звезда
243. Таблица маршрутизации содержит
f) всё вышеперечисленное
244. Таблица коммутации содержит
Список MAC адресов
245. FCE – это
- ложная несущая
246. Управляемые концентраторы позволяют контролировать
Состояние портов
- нагрузку сети по каждому порту
247. Управление работой концентратора производится с использованием протокола
IP
248. Укажите, какие из предложенных сетей входят в частный диапазон IP-адресов:
а) 192.168.0.0/255.255.255.0
c)FC00:112A:86BA:AA11:0:0:0:0/64
e) варианты a) и c)
249. Укажите, какому диапазону предложенных подсетей принадлежит
заданный IP-адрес 192.168.1.9
e) ко всем предложенным
250. Укажите, какому диапазону предложенных подсетей принадлежит
заданный IP-адрес
2001::10.0.4.195
2001::10.0.4.0/120
251. Чему равна двойная задержка на метр для сети Fast Ethernet с
кабелем UTP CAT5?
- 1,112
252. Чему равна двойная задержка на метр для сети Fast Ethernet с кабелем UTP CAT3?
- 1,14
253. Что делает мост, если адреса получателя пакета нет в таблице MAC-адресов?
- пересылает пакет как широковещательный
254. Что делает коммутатор с широковещательным пакетом?
посылает его во все порты, кроме порта отправителя
255. Что не является недостатком сквозного коммутатора?
низкое быстродействие
256. Что такое (или кто такой) системный администратор сети?
- специалист, осуществляющий управление работой сети
257. Что нового появляется в сети Gigabit Ethernet по сравнению с Fast Ethernet?
отказ от метода доступа CSMA/CD
258. Что не входит в задачу системного администратора сети?
контроль за файлами на локальных дисках рабочих станций
259. Что не надо учитывать при проектировании локальной сети?
быстродействие и объем памяти компьютеров-клиентов
260. Что такое коммутаторы третьего уровня (L3)?
коммутаторы, выполняющие маршрутизацию
261. Что не является нововведением сети Gigabit Ethernet?
возможность автоматического выбора скорости передачи
262. Что представляет собой контрольная сумма по методу CRC?
остаток от деления по модулю 2 пакета на полином
263. Что такое карликовый кадр?
кадр, образующийся в результате коллизий
264. Что обеспечивает механизм автосогласования (Auto-Negotiation)?
автоматический выбор максимально возможной скорости обмена
265. Что является преимуществом сегмента 10BASE2?
минимальная стоимость аппаратуры
266. Что является преимуществом 100BASE-FX по сравнению с
100BASE-TX?
большая допустимая длина кабеля
267. Что предполагает метод CSMA/CD?
Обнаружение коллизий
268. Чем отличается сегмент 100BASE-TX от сегмента 10BASE-T кроме скорости передачи?
типом служебных сигналов, передаваемых между пакетами
269. Чему равна двойная задержка на метр для сети Fast Ethernet с оптоволоконным кабелем?
1
270. Чем определяется величина времени доступа к сети при полнодуплексном
обмене?
величиной межпакетного интервала
271. Что такое путь максимальной длины в сети Ethernet/Fast
Ethernet?
путь между двумя абонентами с максимальной задержкой сигнала
272. Что не является преимуществом полнодуплексного режима обмена?
вдвое меньшее время передачи пакета
273. Что происходит в сети Ethernet/Fast Ethernet, если количество передаваемых байт данных
слишком мало?
поле данных пакета дополняется байтами заполнения
274. Чему равна двойная задержка на метр для сети Fast Ethernet с
кабелем UTP CAT3?
1,14
275. Чему равна двойная задержка на метр для сети Fast Ethernet с кабелем UTP CAT5?
1,112+
276. В какой сети сетевая нагрузка не разделяется: с коммутатором или с концентратором:
с концентратором.
277. Выберите маршрут, который необходимо прописать…
Искомая подсеть: 192.168.0.0 маска подсети 255.255.255.248
Настройки сетевого интерфейса (сетевой карты):
IP-адрес 192.168.0.10 маска сети 255.255.255.248
IP-адрес маршрутизатора: 192.168.0.1
IP-адрес маршрутизатора: 192.168.0.9
d) нет необходимости что-либо прописывать
278. Выберите маршрут, который необходимо прописать…
Искомая подсеть: 192.168.2.0 маска подсети 255.255.254.0
Настройки сетевого интерфейса (сетевой карты):
IP-адрес 192.168.1.10 маска сети 255.255.254.0
IP-адрес маршрутизатора: 192.168.0.1
IP-адрес маршрутизатора: 192.168.2.1
b) route add 192.168.2.0 netmask255.255.254.0 gw 192.168.0.1
279.Выберите вид записи маски подсети, который соответствует заданной маске
255.255.248.0:
a) /21
d) 11111111.11111111.11111000.00000000
варианты a) и d)
280.Выберите вид записи маски подсети, который соответствует заданной маске
/16
a) 255.255.0.0
281. В какой сети поддерживается полный дуплекс: с коммутатором или с концентратором?
с коммутатором
282. В стеке протоколов OSI, 10BASE-T находится
на физическом уровне
283. В чем основное преимущество сети FDDI перед остальными стандартными сетями?
максимальный размер сети
284. В чем основное отличие метода управления FDDI от метода управления Token-Ring?
возможность одновременного присутствия в сети нескольких пакетов
285. В формат пакета какой сети не входит поле контрольной суммы?
поле контрольной суммы входит во все пакеты
286. В чем отличие концентратора класса I от концентратора класса II?
он преобразует принятые сигналы перед передачей в цифровую форму
287. В чем состоит основное преимущество сети Arcnet перед Ethernet?
Использование 93-атомного коаксиального кабеля
288. В формат пакета какой сети не входит поле контрольной суммы?
поле контрольной суммы входит во все пакеты
289. В какой сети задержка больше: с коммутатором или с концентратором?
с коммутатором
290. Для чего служит алгоритм Spanning Tree
для удаления замкнутых путей в сети
291. Для полного дуплекса длина оптоволоконного кабеля составляет:
до 2—10 км
292. Допустимая длина сети в методе CSMA/CD:
равна максимальному допустимому PDV
293. Длительность передачи одного бита в CSMA/CD называется:
BT
294. Для чего минимальный размер кадра в Gigabit Ethernet увеличен до 512 байт?
для увеличения допустимой области коллизий
295. Длина сегмента кабеля 100BASE-T ограничена
- 100 метрами
296. Для сети Ethernet 10 Мбит/с PDV не должна превышать
- 512 BT
297. Для сокращения PDV в сети Ethernet следует
- уменьшать длину кабелей
298. Для перехода сети Ethernet на FDDI требуются
- мосты
299. Для чего минимальный размер кадра в Gigabit Ethernet увеличен до 512 байт?
- для увеличения допустимой области коллизий
300. Для скорости выше 10 000 Мбит/с единственной доступной средой передачи является
Оптоволокно
301. Для чего служит сигнал-пробка?
для усиления коллизий
302. С помощью какой команды можно отобразить статистику работы протокола Ethernet
netstat -e
303. Длина сегмента сети 100BASE-FX может достигать
400 метров+
304. Для сети Fast Ethernet двойная задержка концентратора класса II для T4 составляет:
67+
305. Для сети Fast Ethernet двойная задержка концентратора класса II для TX/FX составляет:
92
306. Для чего используется Jam-последовательность?
для усиления коллизии
307. Для синхронизации приема в пакете Ethernet используется
Преамбула
308. Для какого протокола из представленных jumbo frame самый большой
IEEE 802.3
309. ECE это:
множественные коллизии
310. Замкнутый путь в сети носит название
петля
311. Из каких аппаратурных узлов состоит вычислитель циклической контрольной суммы:
из триггеров и элементов «Исключающее ИЛИ»
312. Используется ли буферизация в сетях с коммутацией каналов:
нет, никогда
313. IPG это:
межпакетная щель
314. Импеданс кабеля сегмента 10BASE-5 составляет:
50 Ом
315. Из перечисленных ниже записей выделите сходства Fast Ethernet и Ethernet:
одинаковый формат кадра
316. Из приведенных ниже записей выделите особенности сквозных коммутаторов:
имеют буфер только на заголовок пакета
317. Из приведенных ниже записей выделите топологии, применяемые в Ethernet
пассивная звезда, шина, облако
318. Из приведенных ниже записей выделите составляющие части пакета Ethernet:
контрольная сумма, время трассировки
319. IP-адрес это -
Уникальный сетевой адрес узла в комп. Сети построенный по протоколу IP
320. К какому типу адреса можно отнести MAC-адрес на устройстве Ethernet:
числовой, плоский
321. Кабель сети 10BASE-T для передачи данных между концентратором и узлом сети
называется:
патчкордом
322. Какая сеть не гарантирует величину времени доступа?
Ethernet
323. Какой сегмент известен как "толстый Ethernet"?
10BASE-5
324. К функциям концентраторов Ethernet следует отнести:
a)пересылку пакетов из порта в порты
c) отключение портов в аварийных ситуациях
d)варианты a) и c)
325. Коммутируемый концентратор работает на уровне протоколов –
канальный
326. Коэффициент загрузки сегмента сети для протокола 100BaseTX рассчитывается для кадра
размером
72 байта
327. Какие устройства обычно используются для подключения локальной сети к глобальной
сети?
Маршрутизаторы
328. К функциям концентраторов Ethernet следует отнести
варианты a) и c)
329. Какой кадр можно уверенно считать не искаженным коллизией?
кадр, для которого выполняются все три перечисленные условия
330. Какова длительность сигнала-пробки?
32 битовых интервала
331. Количество единиц в коде образующего полинома CRC должно быть
Минимальным
332. Какую информацию содержит поле управления в пакете Ethernet/Fast Ethernet?
информацию о составе и формате поля данных
333. Какая ошибка не регистрируются и не исправляются репитерными концентраторами?
- ошибка в контрольной сумме пакета
334. Какой трансивер используется в 10Base-5?
- внешний
335. Концентраторы всегда работают в режиме
- полудуплекса
336. Какой параметр сетевого адаптера важен менее других?
поддержка удаленной загрузки
337. Какое сетевое устройство обеспечивает минимальную задержку пересылки пакетов?
концентратор класса II
338. Какое сетевое устройство не может поддерживать обмен между сегментами с разными
скоростями?
коммутатор Cut-Through
339. Какие промежуточные сетевые устройства не допускают управления по протоколу SNMP?
концентраторы класса II
340. Какое сетевое устройство анализирует содержимое поля данных пакета?
Маршрутизатор
341. К основным характеристикам сетевых концентраторов следует отнести
скорость передачи данных, количество портов, тип сетевого носителя
342. К чему приводит увеличение скорости сети со 100 Мбит/с до 1000 Мбит/с?
- к снижению нагрузки на сеть в 10 раз
343. К методам кодирования Gigabit Ethernet следует отнести
- 8B/10B, - PAM5
344. Какой сегмент сети 10Gigabit Ethernet описывается стандартом IEEE 802.3an?
10GBASE-T
345. К перспективным возможностям управления сетью на основе коммутатора следует отнести
контроль трафика, определение предельных скоростей портов, протокол SNMP
346. Какая сеть дороже: с коммутатором или с концентратором?
с концентратором
347. К направлениям развития коммутаторов следует отнести
увеличение скорости коммутирования, поддержку разных стандартных сегментов
348. Какой сегмент сети Gigabit Ethernet наименее перспективен?
1000BASE-CX
349. К промежуточным сетевым устройствам Ethernet следует отнести
репитер, концентратор
350. Какие последствия влечет за собой увеличение скорости сети?
увеличение пропускной способности сети
351. Какова должна быть разрядность образующего полинома для 16-разрядной контрольной
суммы?
17 разрядов
352. Как действует абонент при обнаружении коллизий при методе CSMA/CD?
прекращает передачу пакета и повторяет попытку передать
353. Какова продолжительность IPG?
96 бит
354. Кадр считается искаженным коллизией, если
имеет длину, не равную целому числу байт
имеет длину, меньшую минимально допустимого размера
имеет неправильную контрольную сумму
(Все правильные)
355. Какой сегмент Ethernet/Fast Ethernet обеспечивает наибольшее расстояние между
компьютерами сети?
10BASE-FL
356. Когда необходимо использовать перекрестный кабель в сети 10BASE-T?
при непосредственном соединении между собой двух компьютеров
357. Какие сегменты Fast Ethernet используют одинаковую систему кодировки?
100BASE-TX и 100BASE-FX
358. Какой тип сегмента не распознается механизмом автосогласования (Auto-Negotiation)?
10BASE-FL
359. Какой тип кабеля используется в сегменте 10BASE-T?
витая пара
360. Как распределяются функции витых пар в сегменте 100BASE-T4?
одна витая пара передает в одну сторону, одна— в другую сторону, две витые пары —
двунаправленные
361. Какой стандартный сегмент Ethernet обеспечивает максимальную длину на электрическом
кабеле?
10BASE5
362. Каковы основные достоинства сети Fast Ethernet?
совместимость с Ethernet и высокая скорость передачи
363. Какой метод доступа используется в беспроводных сетях WLAN?
CSMA/CA
364. Каково главное преимущество сети Wi-Fi перед сетью Ethernet/Fast Ethernet?
мобильность и простота подключения
365. К составляющим частям информационного пакета Wi-Fi следует отнести:
контрольную сумму, управление очередностью
366. Какова длина пакета сети Ethernet/Fast Ethernet без преамбулы?
от 64 байт до 1518 байт
367. Каково основное преимущество сети Token-Ring по сравнению с Ethernet/Fast Ethernet?
гарантированное время доступа к сети
368. Какой основной недостаток сети FDDI по сравнению с другими стандартными сетями?
большая стоимость
369. Каково назначение резервного кольца в сети Token-Ring?
оно включается вместо рабочего кольца при повреждении кабеля
370. Каково назначение концентратора в сети 100VG-AnyLAN?
Управление доступом к сети
371. Какую функцию выполняет концентратор сети Token-Ring?
объединение точек подключения абонентов
372. К элементам маркера FDDI относятся:
Преамбула, Статус пакета
373. Какая сеть обеспечивает совместимость с сетью Ethernet на уровне формата пакета?
100VG-AnyLAN
374. К составляющим частям топологии сети Ethernet следует отнести
Концентратор, репитер
375. Как высчитывается задержка повторной передачи в методе CSMA/CD?
задержка выбирается случайно и кратна 512 BT
376. Какие величины необходимо рассчитывать при оценке работоспособности Ethernet?
двойное время распространения по сети и сокращение межпакетного интервала
377. Каким образом можно разбить сеть Ethernet на несколько частей?
с помощью мостов, с помощью коммутаторов
378. Каков метод доступа в сети Wi-Fi?
Случайный
379. Компьютерная сеть это —
система связи компьютеров или вычислительного оборудования (серверы, маршрутизаторы и
другое оборудование)
380. Каково максимально допустимое количество повторов попыток передачи?
16+
381. Какой концентратор можно применять для объединения сегментов 100BASE-TX и 100BASET4?
концентратор класса I
382. Какой метод нельзя применять для преодоления ограничений на размер сети (зоны
конфликта) Ethernet?
применение дополнительных концентраторов
383. К методам контроля ошибок передающим абонентом следует отнести
- сравнение переданного пакета и пакета, возвращенного принимающим абонентом,- побитовую
проверку в процессе передачи пакета
384. Какова максимально допустимая величина сокращения межпакетного интервала в
Ethernet?
49 битовых интервалов
385. Как в сети Fast Ethernet учитывается сокращение межпакетного интервала (IPG)?
для Fast Ethernet расчет этой величины в принципе не нужен
386. Какая сеть не описывается стандартом IEEE 802?
FDDI
387. Какую функцию не выполняет активный монитор сети Token-Ring?
предоставляет абонентам право передачи
388. К составляющим частям PDV следует отнести
Задержки в сетевых адаптерах, задержки в концентраторах
389. Как в сети Ethernet учитываются задержки сетевых адаптеров и концентраторов?
эти задержки входят в задержки сегментов в качестве констант
390. К методам решения проблем Ethernet следует отнести
уменьшение длины кабелей для сокращения PDV
391. Как MAC-адреса удаляются из внутренней таблицы коммутатора?
удаляются только при выключении питания
удаляются системным администратором
не удаляются вообще
392. К типам коммутаторов следует отнести
сквозные коммутаторы, гибридные коммутаторы
393. К стандартным сегментам 10Gigabit Ethernet следует отнести
10GBASE-ER, 10GBASE-LR, 10GBASE-T
394. К функциям сетевого администратора следует отнести
модернизацию программного обеспечения, резервное копирование данных, обучение новых
пользователей
395. К критическим ситуациям сквозных коммутаторов следует отнести
потерю пакетов при одновременном приходе на коммутатор нескольких пакетов
приход на коммутатор карликового пакета
приход на коммутатор испорченного пакета
396. Коэффициент загрузки сегмента сети необходимо рассчитать
Для определения надёжности и стабильности функционирования сети при заданной нагрузке
397. Локальная вычислительная сеть (ЛВС/LAN) Это –
компьютерная сеть, покрывающая обычно относительно небольшую территорию или небольшую
группу зданий
398. Маской подсети называется битовая маска,
определяющая, какая часть IP адреса узла сети относится к адресу сети, а какая к адресу самого
узла в этой сети
399. Метрика –
это числовой показатель, задающий предпочтительность маршрута: чем меньше число, тем более
предпочтителен маршрут
400. Маршрутизация —
процесс определения маршрута следования информации в сетях связи.
401. Максимальная скорость передачи в сети 10BASE-2 составляет
- 10 Мбит/с
402. Маршрутизаторы работают
- с логическими адресами
403. Максимальная скорость передачи данных в сети Fast Ethernet в полудуплексе составляет
100 Мбит/с
404. Максимальная длина сегмента сети 10BASE-2 составляет
185 м
405. Максимальная скорость передачи в сегменте 10BASE-5 составляет
10 Мбит/с
406. Максимальное количество абонентов в сети Ethernet составляет?
1024
407. Максимальное количество абонентов сети Arcnet составляет:
255
408. Максимальная длина сегмента сети 10BASE-5 составляет
500 м
409. Максимальная задержка повтора передачи в методе CSMA/CD составляет
1024 ST
410. Максимальное число абонентов сети Token-Ring составляет
96
411. Метод доступа в сети FDDI является
маркерным+
412. Минимальный интервал между пакетами в CSMA/CD носит название
IPG
413. MAC-адрес это —
уникальный идентификатор, присваиваемый каждой единице активного оборудования
компьютерных сетей
414. На каком уровне протоколов работает концентратор? –
физический
415. На каком уровне работает маршрутизатор?
Сетевой
416. На концах кабеля сегмента 10BASE-5 устанавливаются терминаторы с сопротивлением
- 50 Ом
417. На физическом конце сети 10BASE-2 Т-коннектор, присоединённый к рабочей станции
требует установки терминатора
на 50 Ом
418. На каком уровне сетевой модели OSI работает концентратор?
на физическом
419. На интегральную скорость передачи информации влияют
- время обмена информацией с компьютером,- задержка в промежуточных устройствах
420. На концы кабеля сегмента 10BASE-2 подключаются
BNC-коннекторы
421. Основной характеристикой маршрутизатора является
c) количество обрабатываемых пакетов за секунду
422. Образующий полином в коде CRC должен
делится по модулю 2 без остатка только на единицу и на самого себя
423. Одноранговая сеть - это
Не имеющая централизованного управления ресурсами (узлами)сети….
424. Практическое максимальное число узлов, которые могут быть соединены с 10BASE-5
сегментом, составляет:
100
425. Пакеты какой сети не включают в себя MAC-адреса?
все пакеты включают в себя MAC-адрес
426. Простые коммутаторы не поддерживают
- объединение разнородных сетей,- алгоритм удаления петель
427. Применение каких устройств позволяет снять любые ограничения на размер сети?
Маршрутизаторов
428. Пересылка пакетов в сети с концентратором осуществляется
по одному пакету
429. При проектировании сети следует учитывать
интенсивность информационных потоков в сети, характер передаваемой информации, требуемый
размер сети
430. PDV – это
двойное время прохождения сигнала между абонентами сети+
двойная задержка распространения сигнала
431. Передаваемый в сети Ethernet кадр, размером меньше 512 байт, называется
карликовым
432. Предельная двойная задержка в сети Ethernet составляет
51,2 мкс
433. При делении с остатком степень многочлена-остатка
меньше степени многочлена-делителя
434. При делении с остатком степень многочлена-остатка
меньше степени многочлена-делителя
435. Предельное значение PDV для протокола 100baseT4 будет равно
512
436. Размер сети с коммутатором определяется
широковещательной областью
437. Размер сети с концентратором определяется
областью коллизии
438. Разъемы какого типа не используются в сегменте 10BASE-FL?
разъем RJ-45
439. Размер заголовка TCP пакета составляет
160 бит
440. Размер заголовка кадра Ethernet составляет
112 бит
441. Сетевое устройство, предназначенное для объединения нескольких устройств Ethernet в
общий сегмент сети, носит название.
Концентратор
442. Сетевой концентратор
Сетевое устройство, предназначенное для объединения нескольких устройств Ethernet в общий
сегмент сети, носит название.
443. Сетевые адаптеры могут быть
Внешними, встроенными
444. Скорость передачи данных в сегменте 10BASE-T составляет
10 Мбит/с
445. Сколько байт занимает управление очередностью в пакете Wi-Fi?
2
446. CRC – это
циклический избыточный код
447. Сколько концентраторов может присутствовать в сети (области коллизий) Fast Ethernet?
2 концентратора класса II
448. Топологией сети Token-Ring является:
Кольцо
449. Топологией сети 100VG-AnyLAN является:
Звезда
450. Таблица маршрутизации содержит
f) всё вышеперечисленное
451. Таблица коммутации содержит
Список MAC адресов
452. FCE – это
- ложная несущая
453. Управляемые концентраторы позволяют контролировать
Состояние портов
454. Управление работой концентратора производится с использованием протокола
IP
455. Укажите, какие из предложенных сетей входят в частный диапазон IP-адресов:
а) 192.168.0/255.255.255.0
c) FC00:112A:86BA:AA11:0:0:0:0/64
e) варианты a) и c)
456. Укажите, какому диапазону предложенных подсетей принадлежит заданный IP-адрес
192.168.1.9
e) ко всем предложенным
457. Чему равна двойная задержка на метр для сети Fast Ethernet с кабелем UTP CAT5?
- 1,112
458. Что делает мост, если адреса получателя пакета нет в таблице MAC-адресов?
- пересылает пакет как широковещательный
459. Что делает коммутатор с широковещательным пакетом?
посылает его во все порты, кроме порта отправителя
460. Что не является недостатком сквозного коммутатора?
низкое быстродействие
461. Что такое (или кто такой) системный администратор сети?
- специалист, осуществляющий управление работой сети
462. Что нового появляется в сети Gigabit Ethernet по сравнению с Fast Ethernet?
отказ от метода доступа CSMA/CD
463. Что не входит в задачу системного администратора сети?
контроль за файлами на локальных дисках рабочих станций
464. Что не надо учитывать при проектировании локальной сети?
быстродействие и объем памяти компьютеров-клиентов
465. Что такое коммутаторы третьего уровня (L3)?
коммутаторы, выполняющие маршрутизацию
466. Что не является нововведением сети Gigabit Ethernet?
возможность автоматического выбора скорости передачи
467. Что представляет собой контрольная сумма по методу CRC?
остаток от деления по модулю 2 пакета на полином
468. Что такое карликовый кадр?
кадр, образующийся в результате коллизий
469. Что обеспечивает механизм автосогласования (Auto-Negotiation)?
автоматический выбор максимально возможной скорости обмена
470. Что является преимуществом сегмента 10BASE2?
минимальная стоимость аппаратуры
471. Что является преимуществом 100BASE-FX по сравнению с 100BASE-TX?
большая допустимая длина кабеля
472. Что предполагает метод CSMA/CD?
Обнаружение коллизий
473. Чем отличается сегмент 100BASE-TX от сегмента 10BASE-T кроме скорости передачи?
типом служебных сигналов, передаваемых между пакетами
474. Чему равна двойная задержка на метр для сети Fast Ethernet с оптоволоконным кабелем?
1
475. Чем определяется величина времени доступа к сети при полнодуплексном обмене?
величиной межпакетного интервала
476. Что такое путь максимальной длины в сети Ethernet/Fast Ethernet?
путь между двумя абонентами с максимальной задержкой сигнала
477. Что не является преимуществом полнодуплексного режима обмена?
вдвое меньшее время передачи пакета
478. Что происходит в сети Ethernet/Fast Ethernet, если количество передаваемых байт данных
слишком мало? 
поле данных пакета дополняется байтами заполнения
479. Чему равна двойная задержка на метр для сети Fast Ethernet с кабелем UTP CAT3?
1,14
480. Какая команда из указанных отобразит текущую таблицу маршрутизации в OC Windows?
netstat –r
481. Какое максимальное количество компьютеров может быть в сети с маской
255.255.255.128?
126
482. При определении характеристики маршрутизатора pps какой размер пакетов используется
и почему?
64 байта…
483. При определении характеристики bps маршрутизатора, какой размер пакета используется?
1500
484. Укажите, какой из перечисленных методов использует временное мультиплексирование
CSMA/CD
485. Укажите, какие из предложенных сетей входят в частный диапазон IP-адресов:
а) 10.0.0.0/255.0.0.0
b) 172.16.0.0/255.240.0.0
c) 192.168.0.0/255.255.0.0
f) варианты a) b)и с)
486. Сеть построена с использованием концентратора на протоколе 100baseTX и состоит из…
рассчитать значение PDV
для 5 = 276-300
для 7= 350-399
487. Сколько потребуется кадров максимального размера для протокола Fast Ethernet …
715828
488. Какая служба отвечает за определение приоритетов и дифференцирование трафика:
QoS
490. С помощью какого сервера клиентский компьютер оповещается об адресах серверов DNS
DHCP
491. MAC адрес представляет собой
6 байт, которые для удобства принято записывать в шестнадцатеричной системе счисления
492. С помощью какой команды можно отобразить статистику работы протоколов TCP в OC
Windows
netstat –s –p TCP
493. Укажите на ваш взгляд самую важную характеристику маршрутизатора
Производительность в bps
494. Укажите, какому диапазону предложенных подсетей принадлежит заданный IP-адрес
2001::FC00:112 :
f) Ни к одному из предложенных
495. Для передачи информации по компьютерным сетям используется
Двоичный код
496. Для какого протокола из представленных jumbo frame самый большой
IEEE 802.3
497. Часть пропускной способности, используемая независимо при коммутации, называется
Канал
498. Таблица маршрутизации – это электронная таблица(файл) …
Которая описывает соответствие между адресами назначения и интерфейсами…
499. Минимальный размер данных в кадре Ethernet
46
500. Модуль, который постоянно ожидает прихода из сети запроса от клиента и обслуживает их
Сервер
501. Услуги, предоставляемые службой
Сервис
502. Размер IP-адреса первоначальной версии
4
503. Размер IP-адреса современный версии
6
504. Какая служба используется для разрешения IP-адреса относительно веб-браузера
DNS
505. пара клиент-сервер, предоставляющая доступ к конкретному типу ресурса компьютера
Сетевая служба
506. IP-адрес это –
Уникальный сетевой адрес узла в комп. Сети построенный по протоколу IP
507. Какая организация занимается распределением IP-адресов
ICANN
508. Какой протокол используется для автоматического назначения IP-адресов
DHCP
509. Необходимое условие для подключения компьютера к сети
Сетевая карта
510. Наибольший IP-адрес D
239.255.255.255
511. Наименьший IP-адрес класса E
240.0.0.0.
512. В каком виде представлены данные на сетевом уровне модели OSI
Пакеты
513. Топология, которая получается из полносвязной путем удаления нескольких связей
Ячеистая
514. Топология, в которой каждый компьютер подключается к общему центральному
устройству
Звездообразная
515. Простая маршрутизация
Все варианты
516. На третьем уровне в стеке OSI расположен
Сетевой
517. Какого уровня не существует в стеке OSI
Дейтаграммного, Шифровальный
518. Наименьший IP-адрес класса D
224.0.0.0
519. Конфигурация графа, вершины которого–конечные узлы сети, а ребра–физ или инфо связи
Топология
520. Наименьший IP-адрес класса A
1.0.0.0
521. Единица информации, используемая на пятом уровне стека OSI
Денные
522. не относится к задачам коммутации
Подсчет трафика, нет правильных вариантов ---(задачи вниизу)
523. Приложение использующее локальные ресурсы
Локальное
524. Наименьший IP-адрес класса B
128.0.0.0
525. Какой из протоколов не относится к протоколам прикладного уровня стека TCP/IP
TCP,IP
526. На пятом уровне в стеке OSI расположен уровень
Сеансовый
527. Единственный, заранее проложенный фиксированный маршрут, соединяющий конечные
узлы в сети с коммутацией пакетов
Виртуальный канал
528. Адрес, используемый для идентификации отдельных интерфейсов
Unicast
529. Протокол это
набор правил, определяющий логику обмена сообщениями
530. Операционная система, которая не только обращается к другим сетевым ресурсам, но и
предоставляет свои собственные
Одноранговая
531. Какой физический канал связи осуществляет одновременную передачу информации в двух
направлениях
Дуплексный
532. Какой из протоколов относится к протоколам сетевого уровня стека TCP/IP
IP
533. Какой из уровней считается нижний в модели OSI:
Физический
534. Последовательность узлов, лежащих на пути от получателя к отправителю, называется
Маршрут
535. Операционная система, ориентированная на обработку запросов из сети к ресурсам своего
компьютера, называется:
Серверная
536. Какой электромагнитный диапазон имеет частоту от 300МГц до 300ГГц
Микроволны
537. Какой из терминов обозначает глобальную сеть
WAN
538. Диапазон в стандарте 802.11a
2.4ГГц - 5ГГц
539. Что из перечисленного относится к аппаратуре оперативного переключения (АОП)
Цифровые кросс-коннекторы, мультиплексоры
540. Единица информации, используемая на первом уровне стека OSI
Бит
541. На седьмом уровне в стеке OSI, расположен уровень
Прикладной
542. Какой физический канал связи осуществляет передачу информации в одном направлении
Симплексный
543. Представление данных в виде оптических или электрических сигналов, называется
Кодирование
544. На четвертом уровне в стеке OSI, расположен уровень 
Транспортный
545. Топология, в которой данные от одного компьютера к другому передаются по кругу,
называется
Кольцевая
546. Какой протокол используется для разрешения MAC-адреса относительно AP-адреса
ARP
547. Образование из нескольких отдельных потоков общего потока для передачи по одному
физическому каналу связи, называется
Мультиплексирование
548. Какой из уровней относится к стеку протоколов
Уровень секции(section)(возможно)(гидрав, нету)
549. Канал, построенный путем коммутации элементарных каналов, называется
Составной
550. Сегмент, обеспечивающий передачу данных между двумя соседними узлами сети,
называется
Звено
551. Кто такой оператор сети
Компания, которая поддерживает нормальную работу сети
552. Какой из уровней модели OSI обеспечивает связь между конечными устройствами
Транспортный
553. Что не относится к признакам потока
IP-адресс
554. Максимальная скорость обмена данными в стандарте 802.11b
54Мбит/с
555. Соединение конечных узлов через сеть транзитных узлов называется
Коммутация
556. Каких типов физических каналов связи не существует
Квадроплексный
557. Кто такой поставщик услуг
Компания, которая оказывает платные услуги абонентам сети
558. Какой из протоколов относится к протоколам транспортного уровня стека TCP/IP
UDP
559. Для чего предназначены регенераторы сигналов 
Восстанавливают мощность и форму сигналов
560. Номер бита, определяющий, является ли MAC индивидуальным или групповым
0
561. Порции данных, передаваемые по сетям, не использующих коммутацию каналов,
называется
Таблица или список
562. Какой из уровней модели OSI обеспечивает доступ к среде передачи данных
транспортный
563. Единица информации, используемая на четвертом уровне стека OSI
Сегмент/дейтаграмма
564. Для чего предназначены цифровые кросс-коннекторы(DCC)
Мультиплексируют и коммутируют высокоскоростные потоки STS-n различного уровня между
собой
565. Какой из уровней модели OSI обеспечивает двоичную передачу данных
Физический
566. Какой из кабелей не относится к коасиальным
Параксиальный
567. В каком виде представлены данные на транспортном уровне модели OSI
Блоки
568. Путь между двумя концами сети, называется
Составной канал
569. Способ кодирования двоичных цифр, при котором используется разный уровень
напряжения для каждой цифры, называется
Потенциальное
570. Максимальная скорость обмена данными в стандарте 802.11a
54Мбит/с
571. Минимальный размер кадра Ethernet
64
572. Физический канал связи, который обеспечивает передачу данных в двух направлениях по
очереди. 572. Какой физический канал связи осуществляет поочередную передачу информации
в двух направлениях
Полудуплексный
573. Топология, при которой каждый компьютер непосредственно связан со всеми остальными,
называется
Полносвязная
574. Какого класса IP-адресов не существует
С(G)
575. На втором уровне в стеке OSI, расположен уровень
Канальный
576. Какая сеть называется обратной петлей (loopback)
127.0.0.0
577. Наименьший IP-адрес сети класса C
192.0.0.0
578. Единица представления информации на транспортном уровне модели OSI
Сегмент
579. На шестом уровне в стеке OSI, расположен уровень
Представления
580. Какой из терминов обозначает локальную сеть
LAN
581. Какой из топологии сети не существует
Созвездие
582. Максимальный размер кадра Ethernet
1518
583. Выберете вид записи маски подсети, который соответствует заданной маске:
11111111.11111111.11111111.11000000
255.255.255.192
584. Какой из способов мультиплексирования каналов не существует
NDM (Network Division Multiplexing)
585. Максимальный размер данных в кадре Ethernet
1500
586. Способ кодирования двоичных цифр, при импульсы различной полярности для каждой
цифры, называется
Импульсное
587. Распределенная программа – это программа
Которая состоит из нескольких взаимодействующих частей на одном компьютере
588. Какой электромагнитный диапазон имеет частоту до 3000ГГц
Радиодиапазон
589. Скрученная пара проводников называется
Витая пара
590. Номер бита, определяющий, является ли MAC локальным или централизованным
1
591. Единица информации, используемая на третьем уровне стека OSI
Пакет
592. Распределенными вычислительными системами называются
Мультипроцессорные компьютеры
593. Операционная система, которая предоставляет доступ к ресурсам других компьютеров в
сети, называется
Сетевая
594. Сколько существует классов IP-адресов
5
595. Наибольший IP-адрес сети класса A
126.0.0.0
596. Широковещательный MAC-адресс имеет вид
0xFFFFFFFFFFFF
597. Какой из компьютерных сетей была разработана была разработана самой первой
ARPANET
598. В каком виде представлены данные на канальном уровне модели OSI
Кадры
599. Приложение, состоящее из нескольких взаимодействующих частей, каждая из которых
может выполняться на отдельном компьютере сети, называется
Распределенное
600. Единица информации, используемая на шестом уровне стека OSI
Данные
601. Какой из уровней считается верхним в модели OSI
Прикладной
602. … размера для протокола Fast Ethernet для передачи 1 Гбайта информации
715828
603. Максимальная скорость обмена данными в стандарте Bluetooth
24, 2, 1 Мбит/с
604. Адрес, используемый для доставки данных всем узлам сети, называется
Broadcast
605. Линия связи, в которой промежуточная аппаратура предназначена для передачи сигналов
с конечным числом состояний, называется
Цифровая
606. Линия связи, в которой промежуточная аппаратура предназначена для усиления сигналов с
непрерывным диапазоном значений, называется
Аналаговая
607. Задачи коммутации: определение информационных потоков, определение маршрутов,
сообщение о найденном маршруте, продвижение, модуляция и демодумяция
608. Уровни: доступ к среде –физический, канальный(биты, кадры, frame)(PPP, token ring, Ethernet,
X.25, ATM)
Сетевой – сетевой(дейтаграммы, блоки данных)(IP, ICMP)
Транспортный – транспортный(сегменты)(TCP, UDP)
Прикладной – сеансовый, представление, прикладной(поток)(SSM, SFTP, TELNET, FTP, SMTP, HTTP)
